[
    {
        "id": 1,
        "company": "Tech Solutions Inc.",
        "role": "Frontend Developer",
        "year": "2020 - Present",
        "details": [
            "Developed and maintained the company website using React and Redux.",
            "Collaborated with designers to implement responsive UI/UX designs.",
            "Optimized web applications for maximum speed and scalability."
        ]
    },
    {
        "id": 2,
        "company": "Web Creators LLC",
        "role": "Junior Web Developer",
        "year": "Jun 2018 - Dec 2019",
        "details": [
            "Assisted in the development of client websites using HTML, CSS, and JavaScript.",
            "Participated in code reviews and team meetings to improve coding standards.",
            "Maintained documentation for web development projects."
        ]
    },
    {
        "id": 3,
        "company": "Design Studio",
        "role": "Intern",
        "year": "Jan 2018 - May 2018",
        "details": [
            "Supported the design team with creating mockups and prototypes.",
            "Conducted research on web design trends and best practices.",
            "Helped in testing and debugging web applications."
        ]
    },
    {
        "id": 4,
        "company": "Freelance",
        "role": "Web Developer",
        "year": "2017 - Present",
        "details": [
            "Built and maintained personal and client websites using various web technologies.",
            "Managed project timelines and communicated with clients to ensure satisfaction.",
            "Implemented SEO best practices to improve website visibility."
        ]
    },
    {
        "id": 5,
        "company": "Open Source Contributor",
        "role": "Contributor",
        "year": "2019 - Present",
        "details": [
            "Contributed to various open-source projects on GitHub.",
            "Fixed bugs and added features to improve project functionality.",
            "Collaborated with other developers to review code and suggest improvements."
        ]
    },
    {
        "id": 6,
        "company": "Community Volunteer",
        "role": "Web Developer Volunteer",
        "year": "2020 - Present",
        "details": [
            "Developed and maintained websites for local non-profit organizations.",
            "Provided technical support and training to staff members on website management.",
            "Helped increase online presence and engagement through effective web design."
        ]
    },
    {
        "id": 7,
        "company": "Tech Blog",
        "role": "Content Creator",
        "year": "2018 - Present",
        "details": [
            "Wrote articles and tutorials on web development topics.",
            "Shared insights and experiences to help others in the tech community.",
            "Engaged with readers through comments and social media."
        ]
    },
    {
        "id": 8,
        "company": "Online Course Platform",
        "role": "Course Instructor",
        "year": "2021 - Present",
        "details": [
            "Created and delivered online courses on web development.",
            "Developed course materials, including videos, quizzes, and assignments.",
            "Provided feedback and support to students throughout the course."
        ]
    }
]